; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v1 - type_2 ?v8 - type_1)
 	      (pred_2 ?v3 - object ?v8 - type_1)
	      (pred_3 ?v1 - type_2 ?v7 - type_3)
	      (pred_4 ?v1 - type_2 ?v3 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v1 - type_2 ?v4 ?v5 - type_1)
       :precondition (and  (pred_1 ?v1 ?v4))
       :effect (and  (pred_1 ?v1 ?v5)
		     (not (pred_1 ?v1 ?v4))))

   (:action op_3
       :parameters (?v1 - type_2 ?v6 - object ?v2 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2) (pred_1 ?v1 ?v2) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v6 ?v7)
		    (not (pred_2 ?v6 ?v2)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_2 ?v6 - object ?v2 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v6 ?v7) (pred_1 ?v1 ?v2))
       :effect (and (pred_2 ?v6 ?v2)
		    (pred_3 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_10 - type_1
obj_04 obj_13 obj_11 obj_03 - type_2
obj_08 obj_06 obj_12 obj_05 - type_3
obj_14 obj_01 obj_02 obj_09 - object)
(:init
(pred_1 obj_07 obj_12)
(pred_3 obj_07 obj_04)
(pred_3 obj_07 obj_13)
(pred_1 obj_10 obj_05)
(pred_3 obj_10 obj_11)
(pred_3 obj_10 obj_03)
(pred_2 obj_14 obj_08)
(pred_2 obj_01 obj_06)
(pred_2 obj_02 obj_12)
(pred_2 obj_09 obj_05)
)
(:goal
(and
(pred_2 obj_14 obj_08)
(pred_2 obj_01 obj_05)
(pred_2 obj_02 obj_08)
(pred_2 obj_09 obj_12)
)
)

(:constraints
  (always (not (pred_1 obj_07 obj_05)))
)
)

; plan
1. (op_1 obj_07 obj_12 obj_08)
   deleted: (pred_1 obj_07 obj_12)
   added: (pred_1 obj_07 obj_08)
   goals met: 1 of 4
2. (op_3 obj_10 obj_09 obj_05 obj_03)
   deleted: (pred_2 obj_09 obj_05) (pred_3 obj_10 obj_03)
   added: (pred_4 obj_10 obj_09 obj_03)
   goals met: 1 of 4
3. (op_1 obj_10 obj_05 obj_12)
   deleted: (pred_1 obj_10 obj_05)
   added: (pred_1 obj_10 obj_12)
   goals met: 1 of 4
4. (op_1 obj_07 obj_08 obj_06)
   deleted: (pred_1 obj_07 obj_08)
   added: (pred_1 obj_07 obj_06)
   goals met: 1 of 4
5. (op_2 obj_10 obj_09 obj_12 obj_03)
   deleted: (pred_4 obj_10 obj_09 obj_03)
   added: (pred_2 obj_09 obj_12) (pred_3 obj_10 obj_03)
   goals met: 2 of 4
6. (op_3 obj_10 obj_02 obj_12 obj_11)
   deleted: (pred_2 obj_02 obj_12) (pred_3 obj_10 obj_11)
   added: (pred_4 obj_10 obj_02 obj_11)
   goals met: 2 of 4
7. (op_3 obj_07 obj_01 obj_06 obj_13)
   deleted: (pred_2 obj_01 obj_06) (pred_3 obj_07 obj_13)
   added: (pred_4 obj_07 obj_01 obj_13)
   goals met: 2 of 4
8. (op_1 obj_10 obj_12 obj_08)
   deleted: (pred_1 obj_10 obj_12)
   added: (pred_1 obj_10 obj_08)
   goals met: 2 of 4
9. (op_2 obj_07 obj_01 obj_06 obj_13)
   deleted: (pred_4 obj_07 obj_01 obj_13)
   added: (pred_2 obj_01 obj_06) (pred_3 obj_07 obj_13)
   goals met: 2 of 4
10. (op_2 obj_10 obj_02 obj_08 obj_11)
   deleted: (pred_4 obj_10 obj_02 obj_11)
   added: (pred_2 obj_02 obj_08) (pred_3 obj_10 obj_11)
   goals met: 3 of 4
11. (op_1 obj_10 obj_08 obj_06)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_06)
   goals met: 3 of 4
12. (op_3 obj_10 obj_01 obj_06 obj_03)
   deleted: (pred_2 obj_01 obj_06) (pred_3 obj_10 obj_03)
   added: (pred_4 obj_10 obj_01 obj_03)
   goals met: 3 of 4
13. (op_1 obj_10 obj_06 obj_05)
   deleted: (pred_1 obj_10 obj_06)
   added: (pred_1 obj_10 obj_05)
   goals met: 3 of 4
14. (op_2 obj_10 obj_01 obj_05 obj_03)
   deleted: (pred_4 obj_10 obj_01 obj_03)
   added: (pred_2 obj_01 obj_05) (pred_3 obj_10 obj_03)
   goals met: 4 of 4
